app/controllers/sessions_controller.rb

  def create
    @user = User.find_by_username(params[:session][:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "mbo10@pitt.edu"]]

  def destroy
    User.find(session[:user_id]).destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]